In [1]:
import pandas as pd
import numpy as np

## series : colletion of labelled data

In [2]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s2 = pd.Series([10,20,30,40],index =['i1','i2','i3','i4'])
s2

i1    10
i2    20
i3    30
i4    40
dtype: int64

## Different ways to create series

In [4]:
s1 =pd.Series(np.random.randint(1,50,5))
s1

0     5
1    45
2    12
3    28
4    39
dtype: int32

In [5]:
s1.index=['a','b','c','d','e']
s1

a     5
b    45
c    12
d    28
e    39
dtype: int32

## element access by index, and access by bydefault we write iloc

In [6]:
s1['a']

np.int32(5)

In [7]:
s1.iloc[0]

np.int32(5)

In [8]:
toppers = pd.Series({'IT': 78, 'Mech':77,'civil':80})
toppers

IT       78
Mech     77
civil    80
dtype: int64

## Opereations on Series

In [9]:
s1=pd.Series([10,20,30,40])
s2 =pd.Series([1,2,3,4])
s1+s2

0    11
1    22
2    33
3    44
dtype: int64

In [10]:
s2

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s2[s2 %2==0]

1    2
3    4
dtype: int64

In [12]:
s1=pd.Series([10,20,30,40], index=['a', 'b','c','d'])
s2 = pd.Series([1,2,3,4], index =['c','d','e','f'])
s1+s2

a     NaN
b     NaN
c    31.0
d    42.0
e     NaN
f     NaN
dtype: float64

## DataFRrame

In [13]:
arr1 =np.arange(2,41,2).reshape(4,5)
df =pd.DataFrame(arr1)
df.columns=['c1','c2','c3','c4','c5']
df

   c1  c2  c3  c4  c5
0   2   4   6   8  10
1  12  14  16  18  20
2  22  24  26  28  30
3  32  34  36  38  40

In [14]:
student = pd.DataFrame([[1, 'ram', 60,'m'],
                        [2, 'radha', 80, 'f'],
                        [3, 'sita', 90, 'f']],
                       columns = ['rollno', 'name', 'marks', 'gender'])
student

   rollno   name  marks gender
0       1    ram     60      m
1       2  radha     80      f
2       3   sita     90      f

In [15]:
employee = pd.DataFrame({'eid':[101,102,103,104], 
                         'name':['ram','radha', 'sita', 'shyam'],
                         'age': [23,34,25,21]})
employee

   eid   name  age
0  101    ram   23
1  102  radha   34
2  103   sita   25
3  104  shyam   21

In [16]:
details =  pd.DataFrame({'Intake':[120,60,120,60],
                        'Admitted':[118,50,100,55]},
                        index=['Mech','Civil','Com','E&TC'])
details

       Intake  Admitted
Mech      120       118
Civil      60        50
Com       120       100
E&TC       60        55

## Adding / removing columns or rows

In [17]:
#details['Vacant']=[2,10,20,5]
#details

In [18]:
details['Vacant']= details['Intake']-details['Admitted']
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Com       120       100      20
E&TC       60        55       5

In [19]:
employee

   eid   name  age
0  101    ram   23
1  102  radha   34
2  103   sita   25
3  104  shyam   21

In [20]:
employee['Address'] = ['Pune', 'Mumbai','Pune','Nashik']
employee

   eid   name  age Address
0  101    ram   23    Pune
1  102  radha   34  Mumbai
2  103   sita   25    Pune
3  104  shyam   21  Nashik

In [21]:
employee['Gender'] =['m','f','f','m']
employee

   eid   name  age Address Gender
0  101    ram   23    Pune      m
1  102  radha   34  Mumbai      f
2  103   sita   25    Pune      f
3  104  shyam   21  Nashik      m

In [22]:
employee.loc[4]=[105,'Ganesh',45,'Nagpur','m']
employee

   eid    name  age Address Gender
0  101     ram   23    Pune      m
1  102   radha   34  Mumbai      f
2  103    sita   25    Pune      f
3  104   shyam   21  Nashik      m
4  105  Ganesh   45  Nagpur      m

In [23]:
employee.shape

(5, 5)

In [24]:
employee.loc[employee.shape[0]]=[106,'Tanvi',25,'Delhi','f']
employee

   eid    name  age Address Gender
0  101     ram   23    Pune      m
1  102   radha   34  Mumbai      f
2  103    sita   25    Pune      f
3  104   shyam   21  Nashik      m
4  105  Ganesh   45  Nagpur      m
5  106   Tanvi   25   Delhi      f

In [25]:
student

   rollno   name  marks gender
0       1    ram     60      m
1       2  radha     80      f
2       3   sita     90      f

In [26]:
student = student.drop('gender', axis=1)
student

   rollno   name  marks
0       1    ram     60
1       2  radha     80
2       3   sita     90

In [27]:
student

   rollno   name  marks
0       1    ram     60
1       2  radha     80
2       3   sita     90

In [28]:
student.drop('marks',axis=1, inplace=True)
student

   rollno   name
0       1    ram
1       2  radha
2       3   sita

In [29]:
student.drop(1,inplace=True)
student

   rollno  name
0       1   ram
2       3  sita

In [30]:
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Com       120       100      20
E&TC       60        55       5

In [31]:
details.drop(['Civil','Com'])

      Intake  Admitted  Vacant
Mech     120       118       2
E&TC      60        55       5

In [32]:
details

       Intake  Admitted  Vacant
Mech      120       118       2
Civil      60        50      10
Com       120       100      20
E&TC       60        55       5

In [33]:
details.drop(['Civil','Com'], inplace=True)

In [34]:
details

      Intake  Admitted  Vacant
Mech     120       118       2
E&TC      60        55       5

In [35]:
df

   c1  c2  c3  c4  c5
0   2   4   6   8  10
1  12  14  16  18  20
2  22  24  26  28  30
3  32  34  36  38  40

In [36]:
arr =np.arange(1,26).reshape(5,5)
df2 =pd.DataFrame(arr)
df2.index=['i1','i2','i3','i4','i5']
df2.columns=['A','B','C','D','E']
df2

     A   B   C   D   E
i1   1   2   3   4   5
i2   6   7   8   9  10
i3  11  12  13  14  15
i4  16  17  18  19  20
i5  21  22  23  24  25

In [37]:
df2.loc['i1','A']

np.int64(1)

In [38]:
df2.iloc[0,0]

np.int64(1)

In [39]:
df2.loc['i2','B']

np.int64(7)

In [40]:
df2['D']

i1     4
i2     9
i3    14
i4    19
i5    24
Name: D, dtype: int64

In [41]:
df2.loc[['i2','i3'],['B','C']]

     B   C
i2   7   8
i3  12  13

In [42]:
df2

     A   B   C   D   E
i1   1   2   3   4   5
i2   6   7   8   9  10
i3  11  12  13  14  15
i4  16  17  18  19  20
i5  21  22  23  24  25

In [43]:
df2[df2%2==0]

       A     B     C     D     E
i1   NaN   2.0   NaN   4.0   NaN
i2   6.0   NaN   8.0   NaN  10.0
i3   NaN  12.0   NaN  14.0   NaN
i4  16.0   NaN  18.0   NaN  20.0
i5   NaN  22.0   NaN  24.0   NaN

In [44]:
df2[df2['B']%2==0]

     A   B   C   D   E
i1   1   2   3   4   5
i3  11  12  13  14  15
i5  21  22  23  24  25

In [45]:
employee

   eid    name  age Address Gender
0  101     ram   23    Pune      m
1  102   radha   34  Mumbai      f
2  103    sita   25    Pune      f
3  104   shyam   21  Nashik      m
4  105  Ganesh   45  Nagpur      m
5  106   Tanvi   25   Delhi      f

In [46]:
employee['Address']=='Pune'

0     True
1    False
2     True
3    False
4    False
5    False
Name: Address, dtype: bool

In [47]:
employee[employee['Address']=='Pune']

   eid  name  age Address Gender
0  101   ram   23    Pune      m
2  103  sita   25    Pune      f

In [48]:
employee[employee['Gender']=='m']

   eid    name  age Address Gender
0  101     ram   23    Pune      m
3  104   shyam   21  Nashik      m
4  105  Ganesh   45  Nagpur      m

In [49]:
employee[(employee['age']>23) & (employee['Address']=='Pune')]

   eid  name  age Address Gender
2  103  sita   25    Pune      f

In [50]:
employee['dno']=[1,2,2,3,2,4]
employee

   eid    name  age Address Gender  dno
0  101     ram   23    Pune      m    1
1  102   radha   34  Mumbai      f    2
2  103    sita   25    Pune      f    2
3  104   shyam   21  Nashik      m    3
4  105  Ganesh   45  Nagpur      m    2
5  106   Tanvi   25   Delhi      f    4

In [51]:
employee[employee['dno']==2][['name','age']]

     name  age
1   radha   34
2    sita   25
4  Ganesh   45

In [52]:
employee[employee['Gender']=='f'][['name','age']]

    name  age
1  radha   34
2   sita   25
5  Tanvi   25

In [53]:
details

      Intake  Admitted  Vacant
Mech     120       118       2
E&TC      60        55       5

In [54]:
(details['Admitted']/details['Intake'])*100

Mech    98.333333
E&TC    91.666667
dtype: float64

In [55]:
details[(details['Admitted']/details['Intake'])*100>95]

      Intake  Admitted  Vacant
Mech     120       118       2

In [56]:
employee

   eid    name  age Address Gender  dno
0  101     ram   23    Pune      m    1
1  102   radha   34  Mumbai      f    2
2  103    sita   25    Pune      f    2
3  104   shyam   21  Nashik      m    3
4  105  Ganesh   45  Nagpur      m    2
5  106   Tanvi   25   Delhi      f    4

In [57]:
employee.loc[employee['name']=='sita', 'age']=50
employee

   eid    name  age Address Gender  dno
0  101     ram   23    Pune      m    1
1  102   radha   34  Mumbai      f    2
2  103    sita   50    Pune      f    2
3  104   shyam   21  Nashik      m    3
4  105  Ganesh   45  Nagpur      m    2
5  106   Tanvi   25   Delhi      f    4

In [58]:
employee.loc[(employee['name']=='ram') | (employee['name']=='Ganesh'), 'Address']= 'Chandrapur'
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m    1
1  102   radha   34      Mumbai      f    2
2  103    sita   50        Pune      f    2
3  104   shyam   21      Nashik      m    3
4  105  Ganesh   45  Chandrapur      m    2
5  106   Tanvi   25       Delhi      f    4

In [59]:
employee.loc[employee['Address']=='Pune','dno']= np.nan
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0

## Fnctions in DataFrame

In [60]:
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0

In [61]:
df1=pd.DataFrame(np.arange(1,11).reshape(2,5))
df2=pd.DataFrame(np.arange(21,31).reshape(2,5))

In [62]:
df1

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [63]:
df2

    0   1   2   3   4
0  21  22  23  24  25
1  26  27  28  29  30

In [64]:
df1+df2

    0   1   2   3   4
0  22  24  26  28  30
1  32  34  36  38  40

In [65]:
df1.columns=['A','B','C','D','E']
df2.columns=['C','D','E','F','G']

In [66]:
df1+df2

    A   B   C   D   E   F   G
0 NaN NaN  24  26  28 NaN NaN
1 NaN NaN  34  36  38 NaN NaN

In [67]:
department = pd.DataFrame({'dno':[1,2,3,4], 
                         'name':['IT','ADMIN', 'SCM', 'HR'],
                         'location': ['Pune','Nashik','Pune','Mumbai']})
department

   dno   name location
0    1     IT     Pune
1    2  ADMIN   Nashik
2    3    SCM     Pune
3    4     HR   Mumbai

In [68]:
pd.concat([employee, department], axis=1)

   eid    name  age     Address Gender  dno  dno   name location
0  101     ram   23  Chandrapur      m  1.0  1.0     IT     Pune
1  102   radha   34      Mumbai      f  2.0  2.0  ADMIN   Nashik
2  103    sita   50        Pune      f  NaN  3.0    SCM     Pune
3  104   shyam   21      Nashik      m  3.0  4.0     HR   Mumbai
4  105  Ganesh   45  Chandrapur      m  2.0  NaN    NaN      NaN
5  106   Tanvi   25       Delhi      f  4.0  NaN    NaN      NaN

In [69]:
pd.merge(employee, department, on='dno', how='inner')

   eid  name_x  age     Address Gender  dno name_y location
0  101     ram   23  Chandrapur      m  1.0     IT     Pune
1  102   radha   34      Mumbai      f  2.0  ADMIN   Nashik
2  104   shyam   21      Nashik      m  3.0    SCM     Pune
3  105  Ganesh   45  Chandrapur      m  2.0  ADMIN   Nashik
4  106   Tanvi   25       Delhi      f  4.0     HR   Mumbai

In [70]:
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0

In [71]:
department

   dno   name location
0    1     IT     Pune
1    2  ADMIN   Nashik
2    3    SCM     Pune
3    4     HR   Mumbai

In [72]:
pd.concat([df1, df2])

     A    B   C   D   E     F     G
0  1.0  2.0   3   4   5   NaN   NaN
1  6.0  7.0   8   9  10   NaN   NaN
0  NaN  NaN  21  22  23  24.0  25.0
1  NaN  NaN  26  27  28  29.0  30.0

In [73]:
pd.concat([df1,df2], axis=1)

   A  B  C  D   E   C   D   E   F   G
0  1  2  3  4   5  21  22  23  24  25
1  6  7  8  9  10  26  27  28  29  30

In [74]:
pd.concat([employee, department])

     eid    name   age     Address Gender  dno location
0  101.0     ram  23.0  Chandrapur      m  1.0      NaN
1  102.0   radha  34.0      Mumbai      f  2.0      NaN
2  103.0    sita  50.0        Pune      f  NaN      NaN
3  104.0   shyam  21.0      Nashik      m  3.0      NaN
4  105.0  Ganesh  45.0  Chandrapur      m  2.0      NaN
5  106.0   Tanvi  25.0       Delhi      f  4.0      NaN
0    NaN      IT   NaN         NaN    NaN  1.0     Pune
1    NaN   ADMIN   NaN         NaN    NaN  2.0   Nashik
2    NaN     SCM   NaN         NaN    NaN  3.0     Pune
3    NaN      HR   NaN         NaN    NaN  4.0   Mumbai

In [75]:
pd.concat([employee, department], axis=1)

   eid    name  age     Address Gender  dno  dno   name location
0  101     ram   23  Chandrapur      m  1.0  1.0     IT     Pune
1  102   radha   34      Mumbai      f  2.0  2.0  ADMIN   Nashik
2  103    sita   50        Pune      f  NaN  3.0    SCM     Pune
3  104   shyam   21      Nashik      m  3.0  4.0     HR   Mumbai
4  105  Ganesh   45  Chandrapur      m  2.0  NaN    NaN      NaN
5  106   Tanvi   25       Delhi      f  4.0  NaN    NaN      NaN

In [76]:
pd.merge(employee, department, on='dno', how='inner')

   eid  name_x  age     Address Gender  dno name_y location
0  101     ram   23  Chandrapur      m  1.0     IT     Pune
1  102   radha   34      Mumbai      f  2.0  ADMIN   Nashik
2  104   shyam   21      Nashik      m  3.0    SCM     Pune
3  105  Ganesh   45  Chandrapur      m  2.0  ADMIN   Nashik
4  106   Tanvi   25       Delhi      f  4.0     HR   Mumbai

In [77]:
left_outer=pd.merge(employee, department, on='dno',how='left')
left_outer

   eid  name_x  age     Address Gender  dno name_y location
0  101     ram   23  Chandrapur      m  1.0     IT     Pune
1  102   radha   34      Mumbai      f  2.0  ADMIN   Nashik
2  103    sita   50        Pune      f  NaN    NaN      NaN
3  104   shyam   21      Nashik      m  3.0    SCM     Pune
4  105  Ganesh   45  Chandrapur      m  2.0  ADMIN   Nashik
5  106   Tanvi   25       Delhi      f  4.0     HR   Mumbai

In [78]:
left_outer[['name_x','name_y','location']]

   name_x name_y location
0     ram     IT     Pune
1   radha  ADMIN   Nashik
2    sita    NaN      NaN
3   shyam    SCM     Pune
4  Ganesh  ADMIN   Nashik
5   Tanvi     HR   Mumbai

In [79]:
new_row=pd.DataFrame([[107,'Bhakti',24,'pune','f',2]],
                     columns=employee.columns)
new_row

   eid    name  age Address Gender  dno
0  107  Bhakti   24    pune      f    2

In [80]:
employee=pd.concat([employee, new_row])
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0
0  107  Bhakti   24        pune      f  2.0

In [81]:
employee.reset_index(inplace=True)
employee

   index  eid    name  age     Address Gender  dno
0      0  101     ram   23  Chandrapur      m  1.0
1      1  102   radha   34      Mumbai      f  2.0
2      2  103    sita   50        Pune      f  NaN
3      3  104   shyam   21      Nashik      m  3.0
4      4  105  Ganesh   45  Chandrapur      m  2.0
5      5  106   Tanvi   25       Delhi      f  4.0
6      0  107  Bhakti   24        pune      f  2.0

In [82]:
employee.drop('index', axis=1,inplace=True)
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0
6  107  Bhakti   24        pune      f  2.0

In [83]:
employee['age'].max()

np.int64(50)

In [84]:
employee['age'].min()

np.int64(21)

In [85]:
employee['age'].sum()

np.int64(222)

In [86]:
employee['age'].mean()

np.float64(31.714285714285715)

In [87]:
employee['age'].count()

np.int64(7)

In [88]:
employee['age'].mode()

0    21
1    23
2    24
3    25
4    34
5    45
6    50
Name: age, dtype: int64

In [89]:
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0
6  107  Bhakti   24        pune      f  2.0

In [90]:
employee.groupby('Gender').count()

        eid  name  age  Address  dno
Gender
f         4     4    4        4    3
m         3     3    3        3    3

In [91]:
employee.groupby('Gender')['age'].max()

Gender
f    50
m    45
Name: age, dtype: int64

In [92]:
employee.groupby('dno')['age'].mean()

dno
1.0    23.000000
2.0    34.333333
3.0    21.000000
4.0    25.000000
Name: age, dtype: float64

In [93]:
employee

   eid    name  age     Address Gender  dno
0  101     ram   23  Chandrapur      m  1.0
1  102   radha   34      Mumbai      f  2.0
2  103    sita   50        Pune      f  NaN
3  104   shyam   21      Nashik      m  3.0
4  105  Ganesh   45  Chandrapur      m  2.0
5  106   Tanvi   25       Delhi      f  4.0
6  107  Bhakti   24        pune      f  2.0

In [94]:
employee.groupby('Gender')

In [96]:
pd.DataFrame(employee.groupby('Gender').count())

        eid  name  age  Address  dno
Gender
f         4     4    4        4    3
m         3     3    3        3    3

In [97]:
employee.groupby('Gender')['Gender'].count()

Gender
f    4
m    3
Name: Gender, dtype: int64

In [98]:
employee['Salary']=[23000,45000,24000,21000,56000,27000,32000]
employee

   eid    name  age     Address Gender  dno  Salary
0  101     ram   23  Chandrapur      m  1.0   23000
1  102   radha   34      Mumbai      f  2.0   45000
2  103    sita   50        Pune      f  NaN   24000
3  104   shyam   21      Nashik      m  3.0   21000
4  105  Ganesh   45  Chandrapur      m  2.0   56000
5  106   Tanvi   25       Delhi      f  4.0   27000
6  107  Bhakti   24        pune      f  2.0   32000

In [99]:
employee

   eid    name  age     Address Gender  dno  Salary
0  101     ram   23  Chandrapur      m  1.0   23000
1  102   radha   34      Mumbai      f  2.0   45000
2  103    sita   50        Pune      f  NaN   24000
3  104   shyam   21      Nashik      m  3.0   21000
4  105  Ganesh   45  Chandrapur      m  2.0   56000
5  106   Tanvi   25       Delhi      f  4.0   27000
6  107  Bhakti   24        pune      f  2.0   32000

In [100]:
employee.groupby('Gender')['Salary'].max()

Gender
f    45000
m    56000
Name: Salary, dtype: int64

In [101]:
employee.groupby('dno')['Salary'].mean()

dno
1.0    23000.000000
2.0    44333.333333
3.0    21000.000000
4.0    27000.000000
Name: Salary, dtype: float64

In [102]:
employee['Address'].unique()

array(['Chandrapur', 'Mumbai', 'Pune', 'Nashik', 'Delhi', 'pune'],
      dtype=object)

In [103]:
employee['Address'].nunique()

6

In [104]:
employee.groupby('Address')['Address'].count()

Address
Chandrapur    2
Delhi         1
Mumbai        1
Nashik        1
Pune          1
pune          1
Name: Address, dtype: int64

In [105]:
employee['Address'].value_counts()

Address
Chandrapur    2
Mumbai        1
Pune          1
Nashik        1
Delhi         1
pune          1
Name: count, dtype: int64

In [106]:
employee['dno'].value_counts()

dno
2.0    3
1.0    1
3.0    1
4.0    1
Name: count, dtype: int64

In [107]:
employee['dno'].value_counts()[2.0]

np.int64(3)

In [109]:
employee['Address'].value_counts().index

Index(['Chandrapur', 'Mumbai', 'Pune', 'Nashik', 'Delhi', 'pune'], dtype='object', name='Address')

In [111]:
employee['Address'].value_counts().index[0]

'Chandrapur'

In [112]:
employee.isna()

     eid   name    age  Address  Gender    dno  Salary
0  False  False  False    False   False  False   False
1  False  False  False    False   False  False   False
2  False  False  False    False   False   True   False
3  False  False  False    False   False  False   False
4  False  False  False    False   False  False   False
5  False  False  False    False   False  False   False
6  False  False  False    False   False  False   False

In [114]:
employee.isna().sum()

eid        0
name       0
age        0
Address    0
Gender     0
dno        1
Salary     0
dtype: int64

In [116]:
employee['BG']=['A+','B+','A-','O+',np.nan, np.nan, np.nan]
employee

   eid    name  age     Address Gender  dno  Salary   BG
0  101     ram   23  Chandrapur      m  1.0   23000   A+
1  102   radha   34      Mumbai      f  2.0   45000   B+
2  103    sita   50        Pune      f  NaN   24000   A-
3  104   shyam   21      Nashik      m  3.0   21000   O+
4  105  Ganesh   45  Chandrapur      m  2.0   56000  NaN
5  106   Tanvi   25       Delhi      f  4.0   27000  NaN
6  107  Bhakti   24        pune      f  2.0   32000  NaN

In [118]:
employee.isna()

     eid   name    age  Address  Gender    dno  Salary     BG
0  False  False  False    False   False  False   False  False
1  False  False  False    False   False  False   False  False
2  False  False  False    False   False   True   False  False
3  False  False  False    False   False  False   False  False
4  False  False  False    False   False  False   False   True
5  False  False  False    False   False  False   False   True
6  False  False  False    False   False  False   False   True

In [119]:
employee.isna().sum()

eid        0
name       0
age        0
Address    0
Gender     0
dno        1
Salary     0
BG         3
dtype: int64

In [121]:
emp1=employee.dropna()
emp1

   eid   name  age     Address Gender  dno  Salary  BG
0  101    ram   23  Chandrapur      m  1.0   23000  A+
1  102  radha   34      Mumbai      f  2.0   45000  B+
3  104  shyam   21      Nashik      m  3.0   21000  O+

In [126]:
emp2=employee['Address',axis==1]
emp2

NameError: name 'axis' is not defined

In [127]:
avg_sal=employee[employee['dno']==2.0]['Salary'].mean()
avg_sal

np.float64(44333.333333333336)

In [130]:
employee.loc[employee['name']=='radha','Salary']=np.nan
employee

   eid    name  age     Address Gender  dno   Salary   BG
0  101     ram   23  Chandrapur      m  1.0  23000.0   A+
1  102   radha   34      Mumbai      f  2.0      NaN   B+
2  103    sita   50        Pune      f  NaN  24000.0   A-
3  104   shyam   21      Nashik      m  3.0  21000.0   O+
4  105  Ganesh   45  Chandrapur      m  2.0  56000.0  NaN
5  106   Tanvi   25       Delhi      f  4.0  27000.0  NaN
6  107  Bhakti   24        pune      f  2.0  32000.0  NaN

In [133]:
employee['Salary']=employee['Salary'].fillna(avg_sal)
employee

   eid    name  age     Address Gender  dno        Salary   BG
0  101     ram   23  Chandrapur      m  1.0  23000.000000   A+
1  102   radha   34      Mumbai      f  2.0  44333.333333   B+
2  103    sita   50        Pune      f  NaN  24000.000000   A-
3  104   shyam   21      Nashik      m  3.0  21000.000000   O+
4  105  Ganesh   45  Chandrapur      m  2.0  56000.000000  NaN
5  106   Tanvi   25       Delhi      f  4.0  27000.000000  NaN
6  107  Bhakti   24        pune      f  2.0  32000.000000  NaN